/*
 * @Author: your name
 * @Date: 2022-04-07 14:57:59
 * @LastEditTime: 2022-04-07 20:01:23
 * @LastEditors: Please set LastEditors
 * @Description: 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 * @FilePath: \20220321_CGSY_FREEDO_DTSWEEKLY_ZHCG\src\Views\home\EmergencyManagement\AddPolyline.ts
 */
export const AddPolyline = async (boolean: boolean) => {
  if (boolean) {
    const roods = [
      [
        [563.690491, 1011.970093, -0.100969],
        [573.534241, 1009.796875, -0.101547],
        [589.448608, 1006.050842, -0.101057],
        [604.186157, 1001.106445, -0.100265],
        [619.772339, 997.254761, -0.099963],
        [651.7146, 1028.352051, -0.098853],
        [682.155151, 1050.184692, -0.10001],
      ],
      [
        [559.706848, 1009.968567, -0.100773],
        [557.5672, 1001.487366, -0.100787],
        [556.531982, 996.217896, -0.100811],
        [574.430542, 992.23468, -0.101926],
        [571.779785, 979.007019, -0.100562],
        [546.663208, 942.919556, -6.09998],
        [516.20343, 916.8396, -7.6],
        [489.636108, 876.425354, -8.867598],
        [485.3479, 827.296631, -9.099961],
        [501.71875, 789.304565, -9.100293],
      ],
      [
        [561.931946, 1016.795654, -0.100786],
        [565.945251, 1032.53833, -0.100762],
        [585.905884, 1028.747314, -0.100156],
        [587.914429, 1035.619385, -0.100007],
        [607.722473, 1031.615112, -0.1],
        [637.852417, 1017.767212, -0.100002],
      ],
    ];
    const PS = roods.map((item, index) => {
      return {
        id: "p1" + index, //折线唯一标识id
        coordinates: item, //构成折线的坐标点数组
        color: [0, 0, 1, 1], //折线颜色
        style: 0, //折线样式 参考样式枚举：PolylineStyle
        thickness: 5, //折线宽度
        intensity: 0.8, //亮度
        flowRate: 0.5, //流速
        tiling: 5, //材质贴图平铺比例
        shape: 1, //折线类型 0：直线， 1：曲线
        depthTest: false, //是否做深度检测
      };
    });
    await __g.polyline.clear();
    __g.polyline.add(PS);
  } else {
    await __g.polyline.clear();
  }
};
